In [20]:
import pandas as pd

In [21]:
import numpy as np

In [22]:
titanic_suval = pd.read_csv("titanic_trani.csv")

In [23]:
titanic_suval.head()

,Passend,Survivec,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,dfaefd,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,fdsfd,female,38.0,1,0,PC,71.2833,C85,C
2,3,1,3,asfsa,female,26.0,0,0,STON,7.8000,NaN,S
3,4,0,3,fdsgd,female,27.0,1,1,FSD,8.8000,NaN,S
4,5,0,1,ertfds,female,28.0,1,0,STON,75.0000,NaN,C

In [24]:
age = titanic_suval["Age"]

In [25]:
print(age)

0     22.0
1     38.0
2     26.0
3     27.0
4     28.0
5      NaN
6     30.0
7     31.0
8     32.0
9     33.0
10    34.0
11    35.0
Name: Age, dtype: float64

In [26]:
print(age.loc[0:10])

0     22.0
1     38.0
2     26.0
3     27.0
4     28.0
5      NaN
6     30.0
7     31.0
8     32.0
9     33.0
10    34.0
Name: Age, dtype: float64

In [29]:
age_is_null = pd.isnull(age)

In [30]:
print(age_is_null)

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
Name: Age, dtype: bool

In [31]:
age_null_true = age[age_is_null]

In [32]:
print(age_null_true)

5   NaN
Name: Age, dtype: float64